Repository: rpminspect/rpminspect
Catalog: po/*.po
Languages: ru

source: unable to find before build: %s
ru: невозможно найти до сборки: %s

source: %s is a FIFO
ru: %s это FIFO

source: %s already exists
ru: %s уже существует

source: , overwriting
ru: , перезаписывается

source: %s in %s on %s carries mode %04o, but is on the fileinfo list
ru: %s в %s на %s режим %04o, но есть в списке файловой информации

source: %s in %s on %s carries mode %04o, is on the fileinfo list but expected mode %04o
ru: %s в %s на %s имеет режим %04o, находится в списке информации о файлах, но ожидается режим%04o

source: %s in %s on %s carries insecure mode %04o, Security Team review may be required
ru: %s в %s на %s имеет небезопасный режим %04o, может потребоваться проверка группы безопасности

source: %s in %s on %s carries owner '%s' and is on the fileinfo list
ru: %s в %s на %s имеет владельца '%s' и находится в списке информации о файлах

source: %s in %s on %s carries owner '%s', but is on the fileinfo list with expected owner '%s'
ru: %s в %s на %s имеет владельца '%s', но находится в списке информации о файле с ожидаемым владельцем '%s'

source: %s in %s on %s carries group '%s' and is on the fileinfo list
ru: %s в %s на %s содержит группу '%s' и находится в списке файловой информации

source: %s in %s on %s carries group '%s', but is on the fileinfo list with expected group '%s'
ru: %s в %s на %s содержит группу '%s', но находится в списке информации о файлах с ожидаемой группой '%s'

source: *** payload path %s not in RPM metadata
ru: *** Payload путь %s не в RPM метаданных

source: *** ignore found in %d, value `%s'
ru: *** игнорирование найдено в %d, значение `%s'

source: invalid input string `%s`
ru: неверная строка ввода: `%s`

source: *** invalid mode string: %s
ru: *** неверная строка режима: %s

source: ignoring malformed %s configuration file: %s
ru: игнорирование искаженного файла конфигурации %s: %s

source: *** unknown specname match setting '%s', defaulting to 'full'
ru: *** неизвестная настройка соответствия имени спецификации '%s', по умолчанию - 'full'

source: *** unknown specname primary setting '%s', defaulting to 'name'
ru: *** неизвестная спецификация первичная настройка '%s', по умолчанию 'name'

source: error reading elf include path
ru: ошибка чтения elf include path

source: error reading elf exclude path
ru: ошибка чтения elf exclude path

source: error reading man page include path
ru: ошибка чтения man страницы include path

source: error reading man page exclude path
ru: ошибка чтения man страницы exclude path

source: error reading xml include path
ru: ошибка чтения xml include path

source: error reading xml exclude path
ru: ошибка чтения xml exclude path

source: *** inspection flag must be 'on' or 'off', ignoring for '%s'
ru: *** флаг проверки должен быть 'включен' или 'выключен', игнорируя для '%s'

source: *** Unknown inspection: `%s`
ru: *** Неизвестная инспекция: `%s`

source: *** Invalid filename in the fileinfo list: %s
ru: *** Неверное имя файла в списке информации о файлах: %s

source: *** From this invalid line:
ru: *** Из этой неверной строки:

source: *** error reading '%s'
ru: *** ошибка чтения '%s'

source: *** unable to read profile '%s' from %s
ru: *** невозможно прочитать профиль '%s' с %s

source: Command: %s
ru: Команда: %s

source: ABI comparison ended unexpectedly.
ru: Сравнение ABI неожиданно закончилось.

source: Comparing old vs. new version of %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
ru: Сравнение старой и новой версии %s в пакете %s с уровнем совместимости ABI %ld на %s выявило различия в ABI.

source: Comparing old vs. new version of %s in package %s on %s revealed ABI differences.
ru: Сравнение старой и новой версии %s в пакете %s на %s выявило различия в ABI.

source: Comparing from %s to %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
ru: Сравнение %s до %s в пакете %s с уровнем совместимости ABI %ld на %s выявило различия в ABI.

source: Comparing from %s to %s in package %s on %s revealed ABI differences.
ru: Сравнение %s с %s в пакете %s на %s выявило различия в ABI.

source: Command: %s %s
ru: Команда: %s %s

source: Packages should not contain not files or directories starting with `%s` on %s: %s
ru: Пакеты не должны содержать файлы или каталоги, начинающиеся с `%s` в %s: %s

source: Packages should not contain files or directories ending with `%s` on %s: %s
ru: Пакеты не должны содержать файлы или каталоги, заканчивающиеся на `%s` в %s: %s

source: Forbidden directory `%s` found on %s
ru: Запрещенный каталог `%s` найден в %s

source: New security-related file `%s` added on %s requires inspection by the Security Team
ru: Новый файл, связанный с безопасностью `%s` добавлен к %s требует осмотра Службой Безопасности

source: `%s` added on %s
ru: `%s` добавлен к %s

source: annocheck '%s' test passes for %s on %s
ru: annocheck '%s' тесты пройдены для %s на %s

source: annocheck '%s' test now passes for %s on %s
ru: annocheck '%s' тест сейчас проходит для %s на %s

source: annocheck '%s' test now fails for %s on %s
ru: annocheck '%s' тест в настоящее время не проходит для %s на %s

source: annocheck '%s' test fails for %s on %s
ru: annocheck '%s' тест не проходит для %s на %s

source: lost ${ARCH}
ru: утерян ${ARCH}

source: Architecture '%s' has disappeared
ru: Архитектура '%s' исчезла

source: gained ${ARCH}
ru: получен ${ARCH}

source: Architecture '%s' has appeared
ru: Архитектура '%s' появилась

source: Forbidden function symbols found:
ru: Обнаружены запрещенные функциональные символы:

source: %s may use forbidden functions on %s
ru: %s может использовать запрещенные функции на %s

source: forbidden functions found in ${FILE}
ru: запрещенные функции найдены в ${FILE}

source: File capabilities for %s changed from '%s' to '%s' on %s
ru: Файловые привилегии для %s изменены с '%s' на '%s' в %s

source: ${FILE} capabilities
ru: ${FILE} возможности

source: File capabilities found for %s: '%s' on %s
ru: Файловые привилегии найдены для %s: '%s' в %s

source: File capabilities list entry found for %s: '%s' on %s, matches package
ru: Обнаружена запись в списке возможностей файла для %s: '%s' в %s, совпадает с пакетом

source: File capabilities list mismatch for %s: expected '%s', got '%s'
ru: Несоответствие списка возможностей файла для %s: ожидаемый '%s', получили '%s'

source: ${FILE} capabilities list
ru: ${FILE} список возможностей

source: File capabilities for %s not found on the capabilities list on %s
ru: Возможности файла для %s не найдены в списке возможностей на %s

source: File capabilities expected for %s but not found on %s: expected '%s'
ru: Файловые привилегии ожидаемые для %s но не найдены в %s: ожидаемые '%s'

source: Changes to security policy related files require inspection by the Security Response Team.
ru: Изменения в файлах, связанных с политикой безопасности, требуют проверки группой реагирования на безопасность.

source: Compressed %s file %s changed content on %s.
ru: Сжатый файл %s %s изменил содержимое на %s.

source: Error running msgunfmt on %s on %s
ru: Ошибка запуска msgunfmt в %s в %s

source: msgunfmt on ${FILE}
ru: msgunfmt на ${FILE}

source: Message catalog %s changed content on %s
ru: Каталог сообщений %s содержимое изменено %s

source: Public header file %s changed content on %s. The output of `diff -uw` folloes.
ru: Общедоступный файл заголовка %s изменил содержимое на %s. Далее следует вывод команды `diff -uw`.

source: Public header file %s changed content on %s. Please make sure this does not change the ABI exported by this package. The output of `diff -uw` follows.
ru: Открытый файл заголовка %s изменил содержимое на %s. Убедитесь, что это не меняет ABI, экспортированный этим пакетом. Далее следует вывод команды `diff -uw`.

source: File %s changed content on %s. Please verify this change was deliberate for a non-rebased build.
ru: Файл %s изменил содержимое на %s. Убедитесь, что это изменение было преднамеренным для сборки без перенастройки.

source: %%config file %s went from actual file to symlink (pointing to %s) in %s on %s
ru: %%config файл %s перешел от фактического файла к символической ссылке (указывая на %s) в %s на %s

source: %%config file %s was a symlink (pointing to %s), became an actual file in %s on %s
ru: %%config файл %s был символической ссылкаой (указывая на %s) стал файлом в %s на %s

source: Symlink value for %%config file %s changed in %s on %s.
ru: Значение символической ссылки для %%config файла %s изменено в %s на %s.

source: %%config file content change for %s in %s on %s (comments/whitespace only)
ru: %%config измененил содержимое файла для %s в %s на %s (только комментарии/пробелы)

source: %%config file content change for %s in %s on %s
ru: %%config файл изменен для %s в %s на %s

source: %%config file change for %s in %s on %s (%smarked as %%config -> %smarked as %%config)
ru: %%config файл изменен для %s в %s на %s (%s отмечен как %%config -> %s отмечен как %%config)

source: not
ru: нет

source: Desktop file %s on %s references executable %s but %s is not executable by all
ru: Файл рабочего стола %s на %s ссылается на исполняемый файл %s но %s не исполняемый всеми

source: Desktop file %s on %s references executable %s; no subpackages contain an executable of that name, however it has a TryExec key so it may be ignored in case %s does not exist
ru: Файл рабочего стола %s на %s ссылается на исполняемый файл %s; ни один из подпакетов не содержит исполняемого файла с таким именем, однако у него есть ключ TryExec, поэтому его можно игнорировать, если %s не существует

source: Desktop file %s on %s references executable %s but no subpackages contain an executable of that name
ru: Файл рабочего стола %s на %s ссылается на исполняемый файл %s но подпакеты содержат исполняемый файл с таким же именем

source: Desktop file %s on %s references icon %s but %s is not readable by all
ru: Файл рабочего стола %s на %s ссылается на исполняемый файл %s но %s нечитабельный

source: Desktop file %s on %s references icon %s but no subpackages contain %s
ru: Файл рабочего стола %s на %s ссылается на исполняемый файл %s но подпакеты не содержат %s

source: File %s is no longer a valid desktop entry file on %s; desktop-file-validate reports:
ru: Файл %s больше не является валидным десктопным входным файлом на %s; desktop-file-validate отчет:

source: New file %s is not a valid desktop file on %s; desktop-file-validate reports:
ru: Новый файл %s невалидный десктопный файл на %s; desktop-file-validate отчет:

source: File %s is not a valid desktop file on %s; desktop-file-validate reports:
ru: Файл %s не валидный десктопный файл на %s; desktop-file-validate отчет:

source: The %s file is missing the %s tag.
ru: В файле %s отсутствует тег %s.

source: Release: tag
ru: Релиз: тег

source: The dist tag should be of the form '%s' in the %s tag or in a macro used in the %s tag.
ru: Тег dist должен иметь форму '%s' в теге %s или в макросе, используемом в теге %s.

source: '%%{?dist}' tag
ru: '%%{?dist}' тег

source: The %s tag does not seem to contain '%s' or a macro that expands to include the '%s' tag.
ru: Тег %s, похоже, не содержит '%s' или макроса, который расширяется, чтобы включить тег '%s'.

source: Specified package is not a source RPM, skipping.
ru: Указанный пакет не является исходным RPM, пропускаем.

source: %%doc file content change for %s in %s on %s%s
ru: Изменение содержимого файла %%doc для %s в %s на %s%s

source: (comments/whitespace only)
ru: (только комментарии/пробелы)

source: %%doc file change for %s in %s on %s (%smarked as %%doc -> %smarked as %%doc)
ru: %%doc файл изменен для %s in %s on %s (%s отмечен как %%doc -> %sотмечен как %%doc)

source: %s was an ELF file and now is not on %s
ru: %s был ELF файл и сейчас он не на %s

source: ELF file ${FILE} on ${ARCH}
ru: ELF file ${FILE} на ${ARCH}

source: %s was a dynamic ELF file and now is not on %s
ru: %s был динамический ELF файл и сейчас он не на %s

source: DT_NEEDED symbol(s) removed from %s on %s
ru: DT_NEEDED symbol(s) удален с %s на %s

source: DT_NEEDED symbol(s) in ${FILE}
ru: DT_NEEDED symbol(s) в ${FILE}

source: DT_NEEDED symbol(s) added to %s on %s
ru: DT_NEEDED symbol(s) добавлен к %s на %s

source: Object still has executable stack (no GNU-stack note): %s on %s
ru: Объект все еще имеет исполняемый стек (не GNU-стек запись): %s на %s

source: Object has executable stack (no GNU-stack note): %s on %s
ru: Объект имеет исполняемый стек (не GNU-стек запись): %s на %s

source: Program built without GNU_STACK: %s on %s
ru: Программа собрана без GNU_STACK: %s на %s

source: GNU_STACK on ${FILE}
ru: GNU_STACK на ${FILE}

source: File %s has invalid execstack flags (%s) on %s
ru: Файл %s имеет недопустимые флаги execstack (%s) на %s

source: File %s has unrecognized GNU_STACK '%s' (expected RW or RWE) on %s
ru: Файл %s имеет не распознанный GNU_STACK '%s' (ожидается RW или RWE) на %s

source: execstack on ${FILE}
ru: execstack в ${FILE}

source: Object still has executable stack (GNU-stack note = X): %s on %s
ru: Объект все еще имеет исполняемый стек (GNU-стек запись = X): %s на %s

source: Object has executable stack (GNU-stack note = X): %s on %s
ru: Объект имеет исполняемый стек (GNU-стек запись = X): %s на %s

source: Stack is still executable: %s on %s
ru: Стек все еще исполняемый: %s на %s

source: Stack is executable: %s on %s
ru: Стек является исполняемым: %s на %s

source: %s lost full GNU_RELRO security protection on %s
ru: %s потерял полную GNU_RELRO защиту безопасности на %s

source: %s lost GNU_RELRO security protection on %s
ru: %s потерял GNU_RELRO защиту безопасности на %s

source: GNU_RELRO on ${FILE}
ru: GNU_RELRO в ${FILE}

source: Fortified symbols lost:
ru: Укрепленные символы потеряны:

source: Fortifiable symbols present:
ru: Укрепленные символы присутствуют:

source: %s may have lost -D_FORTIFY_SOURCE on %s
ru: %s могут быть потеряны -D_FORTIFY_SOURCE на %s

source: -D_FORTIFY_SOURCE on ${FILE}
ru: -D_FORTIFY_SOURCE на ${FILE}

source: The following objects lost -fPIC:
ru: Следующие объекты потеряны -fPIC:

source: The following new objects were built without -fPIC:
ru: Следующие объекты были собраны без -fPIC:

source: %s in %s has objects built without -fPIC on %s
ru: %s в %s имеет объекты, построенные без -fPIC на %s

source: -fPIC on ${FILE}
ru: -fPIC на ${FILE}

source: TEXTREL relocations on ${FILE}
ru: Переносы TEXTREL в ${FILE}

source: %s in %s acquired TEXTREL relocations on %s
ru: %s в %s приобрел TEXTREL перемещение на %s

source: %s in %s has TEXTREL relocations on %s
ru: %s в %s имеет TEXTREL перемещение на %s

source: New package %s is empty (no payloads); this is expected per the configuration file
ru: Новый пакет %s пустой (нет полезных нагрузок); это ожидается в файле конфигурации

source: New package %s is empty (no payloads)
ru: Новый пакет %s пустой (нет полезных нагрузок)

source: Forbidden path reference (%s) on line %ld of %s
ru: Ссылка на запрещенный путь (%s) в строке %ld из%s

source: The files inspection is only for source packages, skipping.
ru: Проверка файлов только для пакетов с исходным кодом, пропуская.

source: %s became a non-empty file on %s
ru: %s стал непустым файлом на %s

source: non-empty ${FILE}
ru: не пустой ${FILE}

source: %s became an empty file on %s
ru: %s стал пустым файлом на %s

source: empty ${FILE}
ru: пустой ${FILE}

source: %s grew by %lld%% on %s
ru: %s вырос к %lld%% на %s

source: ${FILE} size grew
ru: ${FILE} размер вырос

source: %s shrank by %lld%% on %s
ru: %s сжался к %lld%% на %s

source: ${FILE} size shrank
ru: ${FILE} размер уменьшился

source: File %s (%s), Java byte code version %d is incorrect (wrong endianness? corrupted file? space JDK?)
ru: Файл %s (%s), Java байт-код версия %d некорректна (неправильный порядок байтов? поврежденный файл? размер JDK?)

source: File %s (%s), Java byte code version %d greater than supported major version %d for product release %s
ru: Файл %s (%s), Java байт-код версия %d больше чем поддерживаемая основная версия %d для релиза продукта %s

source: Java byte code version changed from %d to %d in %s from %s
ru: Java байт-код версия изменена с %d на %d в %s с %s

source: *** missing JVM version to product release mapping
ru: *** отсутствует версия JVM для сопоставления выпуска продукта

source: KMI comparison ended unexpectedly.
ru: Сравнение KMI закончилось неожиданно.

source: Comparing old vs. new version of %s in package %s on %s revealed Kernel Module Interface (KMI) differences.
ru: Сравнение старой и новой версии%s в пакете %s на %s выявило различия в интерфейсе модуля ядра (KMI).

source: Comparing from %s to %s in package %s on %s revealed Kernel Module Interface (KMI) differences.
ru: Сравнение %s с %s в пакете %s на %s выявило различия в интерфейсе модуля ядра (KMI).

source: ${FILE} kernel module alias
ru: ${FILE} псевдоним модуля ядра

source: Kernel module '%s' lost alias '%s'
ru: Модуль ядра '%s' потерял псевдоним '%s'

source: Kernel module '%s' gained alias '%s'
ru: Модуль ядра '%s' получил псевдоним '%s'

source: Kernel module %s removes parameter '%s'
ru: Модуль ядра %s удаляет параметр '%s'

source: ${FILE} kernel module parameter
ru: ${FILE} параметр модуля ядра

source: Kernel module %s adds parameter '%s'
ru: Модуль ядра %s добавляет параметр '%s'

source: Kernel module %s removes dependency '%s'
ru: Модуль ядра %s удаляет зависимости '%s'

source: ${FILE} kernel module dependency
ru: Зависимость модуля ядра ${FILE}

source: Kernel module %s adds dependency '%s'
ru: Модуль ядра %s добавляет зависимости '%s'

source: unable to open license db %s
ru: невозможно открыть базу данных лицензии %s

source: Unapproved license in %s: %s
ru: Неутвержденная лицензия в %s: %s

source: Empty License Tag in %s
ru: Пустой тег лицензии в %s

source: Valid License Tag in %s: %s
ru: Валидный тег лицензии в %s: %s

source: License Tag contains unprofessional language in %s: %s
ru: Лицензионный тег содержит непрофессиональный язык в %s: %s

source: Missing license database: %s: %s
ru: Отсутствует база данных лицензий: %s: %s

source: Existing subpackage %s is now missing
ru: Существующий подпакет %s теперь отсутствует

source: Package %s continues to be empty (no payloads)
ru: Пакет %s все еще пустой (нет полезных нагрузок)

source: Package %s became empty (no payloads)
ru: Пакет %s стал пустым (нет полезных нагрузок)

source: %s contains symbols [%s] on %s; this is not portable across compiler versions
ru: %s содержит символы [%s] на %s; это не переносимо между версиями компилятора

source: %s contains symbol [%s] on %s; this is not portable across compiler versions
ru: %s содержит символ [%s] на %s; это не переносимо между версиями компилятора

source: Error parsing %s:%d:%d: %s: %s: %s
ru: Ошибка анализа %s:%d:%d: %s: %s: %s

source: unable to compile man page path regular expression: %s
ru: невозможно скомпилировать регулярное выражение пути к странице руководства: %s

source: Unable to open man page %s
ru: Невозможно открыть man страницу %s

source: Man page %s does not end in %s
ru: Man страница %s не заканчивается в %s

source: man page with %s suffix is not really compressed with gzip
ru: man страницу с %s суффикс не очень сжат с помощью gzip

source: Errors found validating %s
ru: Найдены ошибки при валидации %s

source: Man page %s is possibly empty on %s in %s
ru: Man страница %s, возможно, пуста на %s в %s

source: Man page checker reported problems with %s on %s in %s
ru: Средство проверки страниц руководства сообщило о проблемах с %s на %s в %s

source: Man page %s has incorrect path on %s in %s
ru: Man страница %s имеет неверный путь к %s в %s

source: Vendor not set in the rpminspect configuration, ignoring Package Vendor "%s" in %s
ru: Поставщик не указан в конфигурации rpminspect, игнорируя поставщика пакета '%s' в %s

source: Package Vendor "%s" is not "%s" in %s
ru: Вендор пакета "%s" не "%s" в %s

source: Package Build Host "%s" is not within an expected build host subdomain in %s
ru: Узел сборки пакета "%s" не находится в поддомене ожидаемого узла сборки в %s

source: Package Summary contains unprofessional language in %s
ru: Сводка пакета содержит непрофессиональный язык в %s

source: Summary: %s
ru: Сводка: %s

source: Package Description contains unprofessional language in %s:
ru: Описание пакета содержит непрофессиональный язык в %s:

source: Gained Package Vendor "%s" in %s
ru: Получил вендора пакета "%s" в %s

source: Lost Package Vendor "%s" in %s
ru: Потерялся вендора пакета "%s" в %s

source: Package Vendor changed from "%s" to "%s" in %s
ru: Вендор пакета изменен с "%s" to "%s" в %s

source: Package Summary change from "%s" to "%s" in %s
ru: Сводка пакета изменена с "%s" to "%s" в %s

source: Package Description changed in %s
ru: Описание пакета изменено в %s

source: from: %s to: %s
ru: с: %s к: %s

source: Package "%s" is part of a module but lacks the '%%{modularitylabel}' header tag.
ru: Пакет "%s" является частью модуля, но не хватает '%%{modularitylabel}' тега заголовка.

source: File %s has forbidden owner `%s` on %s
ru: Файл %s имеет запрещенного владельца `%s` на %s

source: File %s has forbidden group `%s` on %s
ru: Файл %s имеет запрещенную группу `%s` на %s

source: File %s has owner `%s` on %s, but should be `%s`
ru: Файл %s имеет владельца `%s` на %s, но должен быть `%s`

source: File %s on %s has CAP_SETUID capability but group `%s` and is world executable
ru: Файл %s на %s имеет CAP_SETUID опции но группа `%s` и исполняемое слово

source: File %s on %s has CAP_SETUID capability but group `%s` and is group writable
ru: Файл %s на %s имеет CAP_SETUID опции но группа `%s` и является записываемой группой

source: File %s has group `%s` on %s, but should be `%s`
ru: Файл %s имеет группу `%s` на %s, но должна быть `%s`

source: File %s changed %s from `%s` to `%s` on %s
ru: Файл %s изменен %s с `%s` на `%s` на %s

source: Patch %s is under 4 bytes in size - is it corrupt?
ru: Патч %s имеет размер менее 4 байтов - он поврежден?

source: corrupt patch ${FILE}
ru: поврежденный патч ${FILE}

source: %s changed (%ld bytes -> %ld bytes)
ru: %s изменен (%ld бит -> %ld бит)

source: patch file ${FILE}
ru: файл патча ${FILE}

source: New patch file `%s` appeared
ru: Появился новый патч-файл `%s`

source: %s touches as many as %ld line%s
ru: %s затрагивает столько, сколько %ld строки %s

source: %s touches %ld file%s
ru: %s затрагивает %ld файл %s

source: %s touches %ld file%s and %s%ld line%s
ru: %s затрагивает %ld файл %s и %s%ld строку %s

source: as many as
ru: так много как

source: patch changes ${FILE}
ru: патч изменился ${FILE}

source: No source packages available, skipping inspection.
ru: Пакеты с исходным кодом отсутствуют, проверка не выполняется.

source: Patch file `%s` removed
ru: Патч-файл `%s` удален

source: changed
ru: изменен

source: changed setuid/setgid
ru: изменен setuid/setgid

source: relaxed
ru: свободный

source: %s %s permissions from %04o to %04o on %s
ru: %s %s права доступа с %04o к %04o на %s

source: %s (%s) is world-writable on %s
ru: %s (%s) доступный на %s

source: invalid politics entry with pattern=%s and digest=%s
ru: недопустимая запись политики с pattern=%s и digest=%s

source: unknown digest type for pattern %s: %s
ru: неизвестный тип дайджеста для шаблона %s: %s

source: Possible politically sensitive file (%s) found in %s on %s: rules allow this file.
ru: Возможно политически чувствительный файл (%s) найден в %s на %s: правила разрешают этот файл.

source: Possible politically sensitive file (%s) found in %s on %s: rules prohibit this file.
ru: Возможно политически чувствительный файл (%s) найден в %s на %s: правила запрещают этот файл.

source: ${FILE} is politically sensitive
ru: ${FILE} политически чувствителен
