Repository: rpminspect/rpminspect
Catalog: po/*.po
Languages: ru

source: Verify the string specified in the License tag of the RPM metadata describes permissible software licenses as defined by the license database. Also checks to see if the License tag contains any unprofessional words as defined in the configuration file.
ru: Убедитесь, что строка, указанная в теге License метаданных RPM, описывает допустимые лицензии на программное обеспечение, определенные в базе данных лицензий. Также проверьте, содержит ли тег License какие-либо некорректные слова, определенные в файле конфигурации.

source: Check all binary RPMs in the build for any empty payloads. When comparing two builds, report new packages in the after build with empty payloads.
ru: Проверьте все бинарные RPM в до и после сборки на наличие пустых данных. При сравнении двух сборок сообщайте о новых пакетах после сборки с пустыми данными.

source: Check all binary RPMs in the before and after builds for any empty payloads. Packages that lost payload data from the before build to the after build are reported.
ru: Проверьте все двоичные RPM в сборках до и после на предмет пустых полезных данных. Сообщается о пакетах, которые потеряли данные между сборками.

source: Perform some RPM header checks. First, check that the Vendor contains the expected string as defined in the configuration file. Second, check that the build host is in the expected subdomain as defined in the configuration file. Third, check the Summary string for any unprofessional words. Fourth, check the Description for any unprofessional words. Lastly, if there is a before build specified, check for differences between the before and after build values of the previous RPM header values and report them.
ru: Выполните некоторые проверки заголовка RPM. Сначала убедитесь, что поставщик содержит ожидаемую строку, определенную в файле конфигурации. Во-вторых, убедитесь, что хост сборки находится в ожидаемом поддомене, как определено в файле конфигурации. В-третьих, проверьте строку Summary на наличие непрофессиональных слов. В-четвертых, проверьте описание на наличие непрофессиональных слов. Наконец, если задано значение до сборки, проверьте различия между значениями до и после сборки значений предыдущих заголовков RPM и сообщите о них.

source: Perform some checks on man pages in the RPM payload. First, check that each man page is compressed. Second, check that each man page contains valid content. Lastly, check that each man page is installed to the correct path.
ru: Выполните некоторые проверки на страницах руководства в полезной нагрузке RPM. Сначала убедитесь, что каждая страница справочника сжата. Во-вторых, убедитесь, что каждая справочная страница содержит валидный контент. Наконец, убедитесь, что путь установки каждой страницы man валидный.

source: Check that XML files included in the RPM payload are well-formed.
ru: Убедитесь, что файлы XML, включенные в RPM загрузку, правильно сформированы.

source: Perform several checks on ELF files. First, check that ELF objects do not contain an executable stack. Second, check that ELF objects do not contain text relocations. When comparing builds, check that the ELF objects in the after build did not lose a PT_GNU_RELRO segment. When comparing builds, check that the ELF objects in the after build did not lose -D_FORTIFY_SOURCE. Lastly, if there is a list of forbidden library functions, make sure nothing uses them.
ru: Выполните несколько проверок файлов ELF. Сначала убедитесь, что объекты ELF не содержат исполняемый стек. Во-вторых, убедитесь, что объекты ELF не содержат текстовых перемещений. При сравнении сборок убедитесь, что объекты ELF в после сборки не потеряли сегмент PT_GNU_RELRO. При сравнении сборок убедитесь, что объекты ELF в после сборки не потеряли -D_FORTIFY_SOURCE. Наконец, если есть список запрещенных библиотечных функций, убедитесь, что они не используются.

source: Perform syntax and file reference checks on *.desktop files. Syntax errors and invalid file references are reported as errors.
ru: Выполните проверку синтаксиса и ссылок на файлы в файлах *.desktop. Синтаксические ошибки и неправильные ссылки на файлы сообщаются как ошибки.

source: Check that the 'Release' tag in the RPM spec file includes the %{?dist} directive.
ru: Убедитесь, что тег 'Release' в файле спецификации RPM содержит %{?dist} директиву.

source: Ensure the spec file name conforms to the NAME.spec naming format.
ru: Убедитесь, что имя файла спецификации соответствует формату имен NAME.spec.

source: Ensure compliance with modularity build and packaging policies (only valid for module builds, no-op otherwise).
ru: Обеспечьте соответствия политикам сборки и упаковки модульности (действительны только для сборок модулей, в противном случае - нет).

source: Check minimum required Java bytecode version in class files, report bytecode version changes between builds, and report if bytecode versions are exceeded. The bytecode version is vendor specific to releases and defined in the configuration file.
ru: Проверьте на минимальную требуемую версию байт-кода Java в файлах классов, сообщите об изменениях версии байт-кода между сборками и сообщите, превышены ли версии байт-кода. Версия байт-кода зависит от поставщика и определяется в файле конфигурации.

source: Report changed files from the before build to the after build. Certain file changes will raise additional warnings if the concern is more critical than just reporting changes (e.g., a suspected security impact). Any gzip, bzip2, or xz compressed files will have their uncompressed content compared only, which will allow changes through in the compression level used. Message catalog files (.mo) are unpacked and compared using diff(1). Public C and C++ header files are preprocessed and compared using diff(1). Any changes with diff output are included in the results.
ru: Отчет об измененных файлах от до сборки до сборки. Определенные изменения файла вызовут дополнительные предупреждения, если проблема важнее, чем просто сообщение об изменениях (например, связанная с безопасностью). Любые сжатые файлы gzip, bzip2 или xz будут сравниваться только со своим несжатым содержимым, что позволит изменять используемый уровень сжатия. Файлы каталога сообщений (.mo) распаковываются и сравниваются с помощью diff(1). Публичные заголовочные файлы C и C ++ предварительно обрабатываются и сравниваются с использованием diff(1). Любые изменения с выводом diff включены в результаты.

source: Report files that have moved installation paths or across subpackages between builds. Files moved with a security path prefix generate special reporting in case a security review is required. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
ru: Сообщение о файлах, для которых были перемещены пути установки или между подпакетами между сборками. Файлы, перемещенные с префиксом пути безопасности, создают специальный отчет на случай, если потребуется проверка безопасности. Обновленные пакеты сообщают об этих результатах на уровне INFO, в то время как неперебазированные пакеты сообщают о них на уровне VERIFY или выше.

source: Report removed files from the before build to the after build. Shared libraries get additional reporting output as they may be unexpected dependency removals. Files removed with a security path prefix generate special reporting in case a security review is required. Source RPMs and debuginfo files are ignored by this inspection. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
ru: Сообщение об удаленных файлах из предыдущей сборки после сборки. Общие библиотеки получают дополнительный отчет, поскольку они могут быть неожиданными удалениями зависимостей. Файлы, удаленные с префиксом пути безопасности, попадут специальный отчет на случай, если потребуется проверка безопасности. Исходные RPM и файлы debuginfo игнорируются этой проверкой. Обновленные пакеты сообщают об этих результатах на уровне INFO, в то время как неперебазированные пакеты сообщают о них на уровне VERIFY или выше.

source: Report added files from the before build to the after build. Debuginfo files are ignored as are files that match the patterns defined in the configuration file. Files added to security paths generate special reporting in case a security review is required. New setuid and setgid files raise a security warning unless the file is in the fileinfo list. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
ru: Сообщение о добавленных файлах от предыдущей сборки до последующей. Файлы Debuginfo игнорируются, как и файлы, соответствующие шаблонам, определенным в файле конфигурации. Файлы, добавленные в пути безопасности, создают специальные отчеты на случай, если потребуется проверка безопасности. Новые файлы setuid и setgid вызывают предупреждение системы безопасности, если файл не находится в списке fileinfo. Обновленные пакеты сообщают об этих результатах на уровне INFO, в то время как неперебазированные пакеты сообщают о них на уровне VERIFY или выше.

source: Report Source archives defined in the RPM spec file changing content between the before and after build. If the source archives change and the package is on the rebaseable list, the change is reported as informational. Otherwise the change is reported as a rebase of the package and requires inspection.
ru: Архивы источников отчетов, определенные в файле спецификации RPM, меняют содержимое между сборкой до и после сборки. Если исходные архивы изменяются и пакет находится в списке с возможностью переназначения, изменение отображается как информационное. В противном случае изменение регистрируется как перебазирование пакета и требует проверки.

source: Report files and directories owned by unexpected users and groups. Check to make sure executables are owned by the correct user and group. If a before and after build have been specified, also report ownership changes.
ru: Файлы отчетов и каталоги, принадлежащие неожиданным пользователям и группам. Убедитесь, что исполняемые файлы принадлежат правильному пользователю и группе. Если таковые были указаны до и после сборки, также сообщите об изменениях владельца.

source: For all shell scripts in the build, perform a syntax check on it using the shell defined in its #! line (shell must also be listed in shell section of the configuration data). If the syntax check returns non-zero, report it to the user and return a combined stdout and stderr. If comparing two builds, perform the previous check but also report if a previously bad script is now passing the syntax check.
ru: Для всех сценариев оболочки в сборке выполните проверку синтаксиса, используя оболочку, определенную в ее #! line (оболочка также должна быть указана в разделе оболочки данных конфигурации). Если проверка синтаксиса вернет ненулевое значение, сообщите об этом пользователю и верните объединенные stdout и stderr. При сравнении двух сборок выполните предыдущую проверку, но также сообщите, проходит ли проверка синтаксиса ранее некорректный сценарий.

source: Perform annocheck tests defined in the configuration file on all ELF files in the build. A single build specified will perform an analysis only. Two builds specified will compare the test results between the before and after build. If no annocheck tests are defined in the configuration file, this inspection is skipped.
ru: Выполните тесты annocheck, определенные в файле конфигурации для всех файлов ELF в сборке. Одна указанная сборка будет выполнять только анализ. Две указанные сборки будут сравнивать результаты теста до и после сборки. Если в файле конфигурации не определены тесты annocheck, эта проверка пропускается.

source: Compare DT_NEEDED entries in dynamic ELF executables and shared libraries between the before and after build and report changes.
ru: Сравните записи DT_NEEDED в динамических исполняемых файлах ELF и общих библиотеках между изменениями до и после сборки и сообщите об изменениях.

source: Report file size changes between builds. If empty files became non-empty or non-empty files became empty, report those as results needing verification. Report file change percentages as info-only.
ru: Отчет об изменении размера файла между сборками. Если пустые файлы стали непустыми, или непустые файлы стали пустыми, сообщите о них как о результатах, требующих проверки. Процент изменения файла отчета только для информации.

source: Report stat(2) mode changes between builds. Checks against the fileinfo list for the product release specified or determined. Any setuid or setgid changes will raise a message requiring Security Team review.
ru: Отчет об изменениях режима stat(2) между сборками. Проверьте список fileinfo для указанной или определенной версии продукта. Любые изменения setuid или setgid вызовут сообщение, требующее проверки группой безопасности.

source: Report capabilities(7) changes between builds. Checks against the capabilities list for the product release specified or determined. Any capabilities changes not listed will raise a message requiring Security Team review.
ru: Возможности capabilities(7) изменений между сборками. Проверьте список возможностей для указанной или определенной версии продукта. Любые изменения, не внесенные в белый список, вызовут сообщение, требующее проверки командой безопасности.

source: Report kernel module parameter, dependency, PCI ID, or symbol differences between builds. Added and removed parameters are reported and if the package version is unchanged, these messages are reported as failures. The same is true module dependencies, PCI IDs, and symbols.
ru: Сообщение о параметрах модуля ядра, зависимости, идентификаторе PCI или символьных различиях между сборками.Сообщается о добавленных и удаленных параметрах, и если версия пакета не изменилась, эти сообщения регистрируются как ошибки. То же самое и с истинными зависимостями модулей, идентификаторами PCI и символами.

source: Report RPM architectures that appear and disappear between the before and after builds. This inspection does not report the loss of noarch packages. The purpose of this inspection is to report the loss of target machine architectures as provided in the before build and not seeing them in the after build.
ru: Сообщение об архитектурах RPM, которые появляются и исчезают между сборками до и после. Эта проверка не сообщает о потере пакетов noarch. Цель этой проверки - сообщить о потере целевых архитектур машин, как это предусмотрено в предыдущей сборке, и о том, что они не видны в последующей сборке.

source: Report RPM subpackages that appear and disappear between the before and after builds.
ru: Сообщите о RPM-подпакетах, которые появляются и исчезают между сборками.

source: Ensure packages contain an entry in the %changelog for the version built. Reports any other differences in the existing changelog between builds and that the new entry contains new text entries.
ru: Убедитесь, что пакеты содержат запись в %changelog для встроенной версии. Сообщите о любых других различиях в существующем журнале изменений между сборками и о том, что новая запись содержит новые текстовые записи.

source: Report files that are packaged in directories that are no longer used by the product. Usually this means a package has not been updated to account for path migrations. The main examples are /bin migrating to /usr/bin and /sbin migrating to /usr/sbin.
ru: Файлы отчетов, упакованные в каталоги, которые больше не используются продуктом. Обычно это означает, что пакет не был обновлен для учета миграции путей. Основные примеры: / bin, переходящий в /usr/bin, и /sbin, переходящий в /usr/sbin.

source: Link Time Optimization (LTO) produces smaller and faster shared ELF executables and libraries. LTO bytecode is not stable from one release of gcc to the next. As such, LTO bytecode should not be present in .a and .o ELF objects shipped in packages. This inspection looks for LTO bytecode in ELF relocatable objects and reports if any is present.
ru: Оптимизация времени компоновки (LTO) позволяет создавать меньшие и более быстрые общие исполняемые файлы и библиотеки ELF. Байт-код LTO нестабилен от одного выпуска gcc к другому. Таким образом, байт-код LTO не должен присутствовать в объектах .a и .o ELF, поставляемых в пакетах. Эта проверка ищет байт-код LTO в перемещаемых объектах ELF и сообщает о его наличии.

source: Symbolic links must be resolvable on the installed system. This inspection ensures absolute and relative symlinks are valid. It also checks for any symlink usage that will cause problems for RPM.
ru: Символические ссылки должны разрешаться в установленной системе. Эта проверка гарантирует, что абсолютные и относительные символические ссылки действительны. Это также проверяет использование символических ссылок, которые могут вызвать проблемы для RPM.

source: Check %files sections in the spec file for any forbidden path references.
ru: Проверьте разделы %files в файле спецификации на наличие запрещенных ссылок на пути.

source: Compare MIME types of files between builds and report any changes for verification.
ru: Сравните типы файлов MIME между сборками и сообщайте обо всех изменениях для проверки.

source: When comparing two builds or two packages, compare ELF files using abidiff(1) from the libabigail project. Differences are reported. If the package is a rebase and not on the rebaseable list and the rebase inspection is enabled, ABI differences are reported as failures. The assumption here is that rpminspect is comparing builds for maintenance purposes and you do not want to introduce any ABI changes for users. If you do not care about that, turn off the abidiff inspection or add the package name to the rebaseable list.
ru: При сравнении двух сборок или двух пакетов сравните файлы ELF с помощью abidiff(1) из проекта libabigail. Сообщается о различиях. Если пакет является перебазируемым и не включен в список с возможностью перебазирования и включена проверка перебазирования, различия ABI регистрируются как ошибки. Предполагается, что rpminspect сравнивает сборки в целях обслуживания, и вы не хотите вносить какие-либо изменения в ABI для пользователей. Если вас это не волнует, отключите проверку abidiff или добавьте имя пакета в список с возможностью переназначения.

source: kmidiff compares the binary Kernel Module Interfaces of two Linux kernel trees. The binary KMI is the interface that the Linux kernel exposes to its modules. The trees we are interested in here are the result of the build of the Linux kernel source tree. If the builds compared are not considered a rebase, an incompatible change reported by kmidiff is reported for verification.
ru: kmidiff сравнивает двоичные интерфейсы модулей ядра двух деревьев ядра Linux. Двоичный KMI - это интерфейс, который ядро Linux предоставляет своим модулям. Интересующие нас деревья являются результатом построения дерева исходных текстов ядра Linux. Если сравниваемые сборки не считаются перебазированием, для проверки сообщается несовместимое изменение, о котором сообщает kmidiff.

source: Check for and report differences in configuration files marked with %config in the spec file. If changes are whitespace or formatting only, the result is reported at the INFO level. Content and location changes are reporting at the VERIFY level unless the comparison is between rebased packages.
ru: Проверьте и сообщите о различиях в файлах конфигурации, отмеченных %config в файле спецификации. Если изменения касаются только пробелов или форматирования, результат сообщается на уровне INFO. Изменения содержимого и местоположения сообщаются на уровне VERIFY, если сравнение не выполняется между перебазированными пакетами.

source: Report changes in %doc marked files. Files that have been added or removed as documentation files, for instance.
ru: Отчет об изменениях в файлах с пометкой %doc. Например, файлы, которые были добавлены или удалены как файлы документации.

source: Inspects all patches defined in the spec file and reports changes between builds. At the INFO level, rpminspect reports diffstat(1) and patch size changes. If thresholds are reached regarding a change in the patch size or the number of files the patch touches, rpminspect reports the change at the VERIFY level unless the comparison is for a rebase. The configuration file can also list patch names that rpminspect should ignore during the inspection.
ru: Проверьте все исправления, определенные в файле спецификации, и сообщите об изменениях между сборками. На уровне INFO rpminspect сообщает об изменениях diffstat(1) и размера патча. Если достигнуты пороговые значения, касающиеся изменения размера патча или количества файлов, которых он затрагивает, rpminspect сообщает об изменении на уровне VERIFY, если сравнение не выполняется для перебазирования. В файле конфигурации также могут быть перечислены имена патчей, которые rpminspect должен игнорировать во время проверки.

source: Performs a virus scan on every file in the build using libclamav. Anything found by libclamav will fail the inspection. The ignore_path rules are not used in this inspection. All files are scanned.
ru: Выполните проверку на вирусы каждого файла в сборке с помощью libclamav. Все, что обнаружит libclamav, не пройдет проверку. Правила ignore_path не используются в этой проверке. Все файлы проверяются.

source: Check for known politically sensitive files in packages and report if they are allowed or prohibited. The rules come from the politics/ subdirectory in the rpminspect-data package for the product. Files in politics/ subdirectory map to the product release string. The rules in each file define the politically sensitive allow and deny rules for that release.
ru: Проверьте наличие известных политически важных файлов в пакетах и сообщите, разрешены они или запрещены. Правила берутся из подкаталога politics/ в пакете rpminspect-data для продукта. Файлы в подкаталоге politics/ сопоставляются со строкой выпуска продукта. Правила в каждом файле определяют политически важные разрешающие и запрещающие правила для этого выпуска.

source: Check for forbidden functions in ELF files. Forbidden functions are defined in the runtime configuration files. Usually this inspection is used to catch built packages that make use of deprecated API functions if you wish built packages to conform to replacement APIs.
ru: Проверьте запрещенные функции в файлах ELF. Запрещенные функции определены в файлах конфигурации среды выполнения. Обычно эта проверка используется для выявления собранных пакетов, в которых используются устаревшие функции API, если вы хотите, чтобы собранные пакеты соответствовали заменяющим API.

source: Check for forbidden paths in both the DT_RPATH and DT_RUNPATH settings in ELF shared objects.
ru: Проверьте запрещенные пути в настройках DT_RPATH и DT_RUNPATH в общих объектах ELF.

source: Change the string specified on the 'Vendor:' line in the spec file.
ru: Измените строку, указанную в строке 'Vendor': в файле спецификации.

source: Make sure the SRPM is built on a host within the expected subdomain.
ru: Убедитесь, что SRPM собран на хосте в ожидаемом субдомене.

source: Unprofessional language as defined in the configuration file was found in the text shown. Remove or change the offending words and rebuild.
ru: В показанном тексте был обнаружен непрофессиональный язык, определенный в файле конфигурации. Удалите или измените оскорбительные слова и восстановите.

source: Check to see if you eliminated a subpackage but still have the %package and/or the %files section for it.
ru: Проверьте, удалили ли вы подпакет, он все еще есть %package и/или файлы %files секции для него.
