Repository: rpminspect/rpminspect
Catalog: po/*.po
Languages: ru

source: ; Removing security policy related files requires inspection by the Security Response Team.
ru: ; Удаление файлов, связанных с политикой безопасности, требует проверки группой реагирования на безопасность.

source: ABI break: Library %s with SONAME '%s' removed from %s
ru: ABI останов: Библиотека %s с SONAME '%s' удалена с %s

source: ABI break: Library %s removed from %s
ru: ABI останов: Библиотека %s удалена с %s

source: %s removed from %s
ru: %s удалена с %s

source: unable to compile $ORIGIN root prefix regular expression: %s
ru: невозможно скомпилировать регулярное выражение корневого префикса $ORIGIN: %s

source: %s has an invalid-looking %s on %s: %s
ru: %s имеет некорректно выглядящий %s на %s: %s

source: runtime search path in ${FILE}
ru: путь поиска во время выполнения в ${FILE}

source: both DT_RPATH and DT_RUNPATH in ${FILE}
ru: оба DT_RPATH и DT_RUNPATH в ${FILE}

source: %s has both DT_RPATH and DT_RUNPATH on %s; this is not allowed
ru: %s имеет и DT_RPATH, и DT_RUNPATH на %s; это не разрешено

source: %s is a shell script but was not before on %s
ru: %s shell скрипт но не был перед %s

source: %s is a %s script but was a %s script before on %s
ru: %s это %s скрипт но был %s скрипт перед %s

source: %s is no longer a valid %s script on %s
ru: %s более не валидный %s скрипт %s

source: %s became a valid %s script on %s
ru: %s стал валидным %s скрипт %s

source: . The script fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script.
ru: . Сценарий завершается ошибкой с '-n', но проходит с '-O extglob'; убедитесь, что в скрипте установлен параметр 'shopt extglob'.

source: %s is not a valid %s script on %s
ru: %s не валидный %s скрипт на %s

source: %s fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script on %s
ru: %s завершается ошибкой с '-n' но проходит с '-O extglob'; убедитесь что 'shopt extglob' установлен в скрипте на %s

source: exactly match
ru: точное соответствие

source: begin with
ru: начинается с

source: end with
ru: заканчивается на

source: Spec filename does not %s the primary name %s; got '%s'
ru: Имя файла спецификации не %s первичное имя %s; получили '%s'

source: The specname inspection is only for source packages, skipping.
ru: Проверка имени спецификации предназначена только для пакетов с исходным кодом, пропускаем.

source: Subpackage '%s' has disappeared on '%s'
ru: Подпакет '%s' исчез с '%s'

source: subpackage ${FILE}
ru: подпакет ${FILE}

source: Subpackage '%s' has appeared on '%s'
ru: Подпакет '%s' появился на '%s'

source: Directory %s became a symbolic link (to %s) in %s on %s; this is not allowed!
ru: Каталог %s стал символической ссылкой (на %s) в %s на %s; это не разрешено!

source: %s %s became a symbolic link (to %s) in %s on %s
ru: %s %s стала символической ссылкой (к %s) в %s на %s

source: An error occurred reading symbolic link %s in %s on %s.
ru: Произошла ошибка при чтении символической ссылки %s в %s на %s.

source: %s %s has too many levels of redirects and cannot be resolved in %s on %s
ru: %s %s имеет слишком много уровней переадресации и не может быть разрешен в %s на %s

source: %s %s %s a dangling symbolic link in %s on %s
ru: %s %s %s висящая символическая ссылка в %s в %s

source: ${FILE} MIME type
ru: ${FILE} MIME тип

source: MIME type on %s was %s and became %s on %s
ru: Тип MIME на %s был %s и стал %s на %s

source: New upstream source file `%s` appeared
ru: Появился новый исходный файл апстрима `%s`

source: source file ${FILE}
ru: исходный файл ${FILE}

source: Upstream source file `%s` changed content
ru: Исходный файл апстрима `%s` изменил содержимое

source: checksum of ${FILE}
ru: контрольная сумма ${FILE}

source: Source file `%s` removed
ru: Исходный файл `%s` удален

source: cl_engine_new() returned NULL, check clamav library
ru: cl_engine_new() вернул NULL, проверьте библиотеку clamav

source: Virus detected in %s in the %s package on %s: %s
ru: В %s в пакете %s на %s: %s обнаружен вирус

source: clamav version information
ru: информация о версии clamav

source: clamav version %s
ru: версия clamav %s

source: %s version %u (%s)
ru: %s версия %u (%s)

source: virus or malware in ${FILE}
ru: вирус или вредоносное ПО в ${FILE}

source: %s is a well-formed XML file in %s on %s, but is not a valid XML file
ru: %s - это правильно сформированный XML-файл в %s на %s, но не является допустимым XML-файлом

source: %s is not a well-formed XML file in %s on %s
ru: %s не является правильно сформированным XML-файлом в %s на %s

source: XML-RPC Fault: %s (%d)
ru: XML-RPC Ошибка: %s (%d)

source: unable to initialize the magic library
ru: невозможно инициализировать волшебную библиотеку

source: unable to load the magic database: %s
ru: невозможно загрузить волшебную базу данных: %s

source: *** unable to mkdir %s
ru: невозможно создать директорию %s

source: Plain text suitable for the console and piping through paging programs.
ru: Простой текст, подходящий для консоли и передачи через программы подкачки.

source: Results organized as a JSON data structure suitable for reading by web applications and other frontend tools.
ru: Результаты, организованные в виде структуры данных JSON, подходящей для чтения веб-приложениями и другими инструментами внешнего интерфейса.

source: Results organized as an XUnit data structure suitable for use with Jenkins and other XUnit-enabled services.
ru: Результаты организованы в виде структуры данных XUnit, подходящей для использования с Jenkins и другими службами с поддержкой XUnit.

source: error opening %s for writing
ru: ошибка открытия %s для записи

source: Result: %s
ru: Результат: %s

source: Waiver Authorization: %s
ru: Разрешение на отказ: %s

source: Details: %s
ru: Подробности: %s

source: Suggested Remedy: %s
ru: Предлагаемое средство: %s

source: opening %s for writing
ru: открытие %s для записи

source: Result: %s Waiver Authorization: %s
ru: Результат: %s Отказ от авторизации : %s

source: libelf version mismatch
ru: несоответствие версий libelf

source: Fopen() failed for %s: %s
ru: Ошибка Fopen() для %s:%s

source: *** unable to find tag %s for %s
ru: невозможно найти тег %s для %s

source: *** file index %d is out of bounds for %s
ru: *** индекс файла %d выходит за пределы для %s

source: error running `%s`
ru: ошибка при запуске `%s`

source: error closing `%s`
ru: ошибка закрытия `%s`

source: INFO
ru: ИНФОРМАЦИЯ

source: WAIVED
ru: ОТКАЗАНО

source: VERIFY
ru: ПРОВЕРЕНО

source: BAD
ru: ПЛОХОЙ

source: UnKnOwN
ru: Неизвестный

source: Not Waivable
ru: Не подлежит отмене

source: Anyone
ru: Кто угодно

source: Security
ru: Безопасность

source: regular file
ru: обычный файл

source: directory
ru: каталог

source: character device
ru: символьное устройство

source: block device
ru: блочное устройство

source: FIFO (named pipe)
ru: FIFO (именованный канал)

source: symbolic link
ru: символическая ссылка

source: socket
ru: сокет

source: UNKNOWN
ru: НЕИЗВЕСТНЫЙ

source: Compare package builds for policy compliance and consistency.
ru: Сравните сборки пакетов на соответствие политикам и согласованность.

source: Usage: %s [OPTIONS] [before build] [after build]
ru: Использование: %s [ПАРАМЕТРЫ] [перед сборкой] [после сборки]

source: Options:
ru: Параметры:

source: -c FILE, --config=FILE Configuration file to use
ru: -c FILE, --config=FILE Файл конфигурации для использования

source: -p NAME, --profile=NAME Configuration profile to use
ru: -p NAME, --profile=NAME Профиль конфигурации для использования

source: -T LIST, --tests=LIST List of tests to run
ru: -T LIST, --tests=LIST Список тестов для запуска

source: (default: ALL)
ru: (по умолчанию: ALL)

source: -E LIST, --exclude=LIST List of tests to exclude
ru: -E LIST, --exclude=LIST Список тестов для исключения

source: (default: none)
ru: (по умолчанию: none)

source: -a LIST, --arches=LIST List of architectures to check
ru: -a LIST, --arches=LIST Список архитектур для проверки

source: -r STR, --release=STR Product release string
ru: -r STR, --release=STR Строка релиза продукта

source: -n, --no-rebase Disable build rebase detection
ru: -n, --no-rebase Отключить обнаружение переустановки сборк

source: -o FILE, --output=FILE Write results to FILE
ru: -o FILE, --output=FILE Записать результаты в FILE

source: (default: stdout)
ru: (по умолчанию: stdout)

source: -F TYPE, --format=TYPE Format output results as TYPE
ru: -F TYPE, --format=TYPE Отформатировать выходной результат как TYPE

source: (default: text)
ru: (по умолчанию: text)

source: -t TAG, --threshold=TAG Result threshold triggering exit
ru: -t TAG, --threshold=TAG Результат срабатывания триггера выхода

source: failure (default: VERIFY)
ru: неудача (по умолчанию: VERIFY)

source: -l, --list List available tests and formats
ru: -l, --list Список доступных тестов и форматов

source: -w PATH, --workdir=PATH Temporary directory to use
ru: -w PATH, --workdir=PATH Временный каталог для использования

source: (default: %s)
ru: (по умолчанию: %s)

source: -f, --fetch-only Fetch builds only, do not perform inspections
ru: -f, --fetch-only Получать только сборки, не проверять

source: (implies -k)
ru: (подразумевает -k)

source: -k, --keep Do not remove the comparison working files
ru: -k, --keep Не удалять рабочие файлы сравнения

source: -d, --debug Debugging mode output
ru: -d, --debug Вывод в режиме отладки

source: -D, --dump-config Dump configuration settings used (in YAML format)
ru: -D, --dump-config Используемые параметры конфигурации дампа (в формате YAML)

source: -v, --verbose Verbose inspection output
ru: -v, --verbose Подробный вывод проверки

source: when finished, display full path
ru: по завершении отобразить полный путь

source: -?, --help Display usage information
ru: -?, --help Показать информацию об использовании

source: -V, --version Display program version
ru: -V, --version Показать версию программы

source: See the rpminspect(1) man page for more information.
ru: См. rpminspect(1) man страницу для дополнительной информации.

source: *** Product release for after build (%s) is empty
ru: *** Выпуск продукта для после сборки (%s) пустой

source: *** Product release for before build (%s) is empty
ru: *** Выпуск продукта для сборки (%s) пустой

source: *** unable to compile product release regular expression: %s
ru: *** невозможно скомпилировать регулярное выражение релиза продукта: %s

source: *** Unable to determine product release for %s and %s
ru: *** Невозможно определить релиз продукта для %s и для %s

source: *** The -T and -E options are mutually exclusive
ru: *** -T и -E варианты взаимоисключающие

source: *** See `%s --help` for more information.
ru: *** См. `%s --help` для деталей.

source: *** Invalid output format: `%s`.
ru: *** Неверный формат вывода: `%s`.

source: *** Unable to expand workdir: `%s`
ru: *** Невозможно расширить рабочий каталог: `%s`

source: %s version %s
ru: %s версия %s

source: ?? getopt returned character code 0%o ??
ru: ?? getopt возвращенный код символа 0%o ??

source: Available output formats:
ru: Доступные форматы вывода:

source: Available inspections:
ru: Доступные проверки:

source: Failed to read configuration file %s
ru: Не удалось прочитать файл конфигурации %s

source: Please specify a configuration file using '-c' or supply ./%s
ru: Укажите файл конфигурации с помощью '-c' или supply ./%s

source: *** Invalid before and after build specification.
ru: *** Недопустимая спецификация сборки до и после.

source: *** unable to read RPM configuration
ru: *** невозможно прочитать конфигурацию RPM

source: *** Unsupported architecture specified: `%s`
ru: *** Указана неподдерживаемая архитектура: `%s`

source: *** Unable to create directory %s
ru: *** Невозможно создать каталог %s

source: *** failed to gather specified builds.
ru: *** Не удалось собрать указанные сборки.

source: diagnostics
ru: диагностика

source: Version information for libraries and programs used by %s. This result is for informational and diagnostic purposes only.
ru: Информация о версиях библиотек и программ, используемых %s. Этот результат предназначен только для информационных и диагностических целей.

source: Command line arguments used to invoke %s.
ru: Аргументы командной строки, используемые для вызова %s.

source: *** No peers, ensure packages exist for specified architecture(s).
ru: *** Нет одноранговых узлов, убедитесь, что пакеты существуют для указанной архитектуры/архитектур.

source: invalid after RPM
ru: недействителен после RPM

source: invalid before RPM
ru: недействителен перед RPM

source: Running %s inspection...
ru: Выполняется проверка %s ...

source: pass
ru: прошел

source: FAIL
ru: ОТКАЗ

source: Keeping working directory: %s
ru: Сохранение рабочего каталога: %s
