Repository: rpminspect/rpminspect
Catalog: po/*.po
Languages: ru

source: The License tag must contain an approved license string as defined by the distribution (e.g., GPLv2+). If the license in question is approved, the license database needs updating in the rpminspect-data package.
ru: Тег лицензии должен содержать утвержденную строку лицензии, как определено в распространении (например, GPLv2 +). Если соответствующая лицензия утверждена, базу данных лицензий необходимо обновить в пакете rpminspect-data.

source: Make sure the licensedb setting in the rpminspect configuration is set to a valid licensedb file. This is also commonly due to a missing vendor specific rpminspect-data package on the system.
ru: Убедитесь, что параметр licensedb в конфигурации rpminspect установлен на допустимый файл licensedb. Это также часто связано с отсутствием в системе пакета rpminspect-data конкретного поставщика.

source: The specified license abbreviation is not listed as approved in the license database. The license database is specified in the rpminspect configuration file. Check this file and send a pull request to the appropriate upstream project to update the database. If the license is listed in the database but marked unapproved, you may need to work with the legal team regarding options for this software.
ru: Указанное сокращение лицензии не указано как утвержденное в базе данных лицензий. База данных лицензий указана в файле конфигурации rpminspect. Проверьте этот файл и отправьте запрос на перенос в соответствующий вышестоящий проект для обновления базы данных. Если лицензия указана в базе данных, но помечена как неутвержденная, возможно, вам придется обсудить с юридической группой варианты для этого программного обеспечения.

source: Ensure all object files are compiled with -fPIC
ru: Убедитесь, что все объектные файлы скомпилированы с -fPIC

source: Ensure that the package is being built with the correct compiler and compiler flags
ru: Убедитесь, что пакет создается с правильными компилятором и флагами компилятора

source: The data in an ELF file appears to be corrupt; ensure that packaged ELF files are not being truncated or incorrectly modified
ru: Данные в файле ELF повреждены; убедитесь, что упакованные файлы ELF не усекаются или неправильно изменяются

source: An ELF stack is marked as executable. Ensure that no execstack options are being passed to the linker, and that no functions are defined on the stack.
ru: Стек ELF помечен как исполняемый. Убедитесь, что компоновщику не передаются никакие параметры execstack и что в стеке не определены функции.

source: Ensure executables are linked with with '-z relro -z now'
ru: Убедитесь, что исполняемые файлы проликованы с '-z relro -z now'

source: Ensure all object files are compiled with '-O2 -D_FORTIFY_SOURCE=2', and that all appropriate headers are included (no implicit function declarations). Symbols may also appear as unfortified if the compiler is unable to determine the size of a buffer, which is not necessarily an error.
ru: Убедитесь, что все объектные файлы скомпилированы с '-O2 -D_FORTIFY_SOURCE = 2' и что включены все соответствующие заголовки (без неявных объявлений функций). Символы также могут отображаться как незакрепленные, если компилятор не может определить размер буфера, что не обязательно является ошибкой.

source: Please review all usages of IPv4-only functions and ensure IPv6 compliance.
ru: Просмотрите все случаи использования функций только для IPv4 и убедитесь в соответствии IPv6.

source: Correct the errors in the man page as reported by the libmandoc parser.
ru: Исправьте ошибки на man странице, о которых сообщает синтаксический анализатор libmandoc.

source: Correct the installation path for the man page. Man pages must be installed in the directory beneath /usr/share/man that matches the section number of the page.
ru: Исправьте путь установки для man страницы. Man cтраницы должны быть установлены в каталоге ниже /usr/share/man, который соответствует номеру раздела страницы.

source: Correct the reported errors in the XML document
ru: Исправьте обнаруженные ошибки в XML-документе

source: Refer to the Desktop Entry Specification at https://standards.freedesktop.org/desktop-entry-spec/latest/ for help correcting the errors and warnings
ru: Обратитесь к Спецификации Desktop Entry на https://standards.freedesktop.org/desktop-entry-spec/latest/ для получения помощи по исправлению ошибок и предупреждений

source: The Release: tag in the spec file must include a '%{?dist}' string. Please add this to the spec file per the distribution packaging guidelines.
ru: Release: тег в файле спецификации должен включать строку '%{?dist}'. Пожалуйста, добавьте это в файл спецификации в соответствии с инструкциями по упаковке дистрибутива.

source: The spec file name does not match the expected NAME.spec format. Rename the spec file to conform to this policy.
ru: Имя файла спецификации не соответствует ожидаемому формату NAME.spec format. Переименуйте файл спецификации в соответствии с этим правилом.

source: This package is part of a module but is missing the %{modularitylabel} header tag. Add this as a %define in the spec file and rebuild.
ru: Этот пакет является частью модуля, но в нем отсутствует тег заголовка%{modularitylabel}. Добавьте это как %define в файл спецификации и пересоберите.

source: The Java bytecode version for one or more class files in the build was not met for the product release. Ensure you are using the correct JDK for the build.
ru: Версия байт-кода Java для одного или нескольких файлов классов в сборке не соответствует релизу. Убедитесь, что вы используете правильный JDK для сборки.

source: Unexpected file changes were found. Verify these changes are correct. If they are not, adjust the build to prevent file changes.
ru: Обнаружены непредвиденные изменения файла. Убедитесь, что эти изменения верны. Если это не так, настройте сборку, чтобы предотвратить изменения файлов.

source: Unexpected file moves were found. Verify these changes are correct. If they are not, adjust the build to prevent the file moves between builds.
ru: Обнаружены непредвиденные перемещения файлов. Убедитесь, что эти изменения верны. Если это не так, настройте сборку, чтобы файл не перемещался между сборками.

source: Unexpected file removals were found. Verify these changes are correct. If they are not, adjust the build to prevent the file removals between builds.
ru: Обнаружены непредвиденные удаления файлов. Убедитесь, что эти изменения верны. Если это не так, настройте сборку, чтобы предотвратить удаление файлов между сборками.

source: Unexpected file additions were found. Verify these changes are correct. If they are not, adjust the build to prevent the file additions between builds.
ru: Обнаружены неожиданные добавления файлов. Убедитесь, что эти изменения верны. Если это не так, отрегулируйте сборку, чтобы предотвратить добавление файлов между сборками.

source: Unexpected changed source archive content. The version of the package did not change between builds, but the source archive content did. This may be deliberate, but needs inspection.
ru: Неожиданно изменено содержимое исходного архива. Версия пакета не менялась между сборками, но содержимое исходного архива менялось. Это может быть сделано намеренно, но требует проверки.

source: Make sure the %files section includes the %defattr macro.
ru: Убедитесь, что в разделе %files есть макрос %defattr.

source: Bin path files must be owned by the bin_owner set in the rpminspect configuration, which is usually root.
ru: Bin путь к файлам должен принадлежать bin_owner, установленному в rpminspect.conf, который обычно является root.

source: Bin path files must be owned by the bin_group set in the rpminspect configuration, which is usually root.
ru: Bin путь к папке должны принадлежать группе bin_group, установленной в конфигурации rpminspect, обычно это root.

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the world execute bit on the file (chmod o-x).
ru: Либо chgrp файл в bin_group, установленный в конфигурации rpminspect, либо удалите world бит выполнения в файле (chmod o-x).

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the group write bit on the file (chmod g-w).
ru: Либо chgrp файл в bin_group, установленный в конфигурации rpminspect, либо удалите бит групповой записи в файле (chmod g-w).

source: Verify the ownership changes are expected. If not, adjust the package build process to set correct owner and group information.
ru: Убедитесь, что смена владельца ожидаемая. Если нет, настройте процесс сборки пакета, чтобы указать правильную информацию о владельце и группе.

source: Consult the shell documentation for proper syntax.
ru: Обратитесь к документации оболочки shell для правки синтаксиса.

source: The file referenced was not a known shell script in the before build but is now a shell script in the after build.
ru: Указанный файл не был известным сценарием оболочки shell в предыдущей сборке, но теперь является сценарием оболочки shell в последующей сборке.

source: The referenced shell script is invalid. Consider debugging it with the '-n' option on the shell to find and fix the problem.
ru: Указанный shell скрипт недействителен. Рассмотрите возможность отладки с помощью опции '-n' в терминале, чтобы найти и исправить проблему.

source: See annocheck(1) for more information.
ru: См. Дополнительную информацию в annocheck(1).

source: DT_NEEDED symbols have been added or removed. This happens when the build environment has different versions of the required libraries. Sometimes this is deliberate but sometimes not. Verify these changes are expected. If they are not, modify the package spec file to ensure the build links with the correct shared libraries.
ru: Добавлены или удалены символы DT_NEEDED. Это происходит, когда в среде сборки есть разные версии необходимых библиотек. Иногда это делается намеренно, а иногда нет. Убедитесь, что эти изменения ожидаются. Если это не так, измените файл спецификации пакета, чтобы гарантировать, что сборка связана с правильными общими библиотеками.

source: A previously empty file is no longer empty. Make sure this change is intended and fix the package spec file if necessary.
ru: Ранее пустой файл больше не пустой. Убедитесь, что это изменение преднамеренно, и при необходимости исправьте файл спецификации пакета.

source: A previously non-empty file is now empty. Make sure this change is intended and fix the package space file if necessary.
ru: Ранее непустой файл теперь пуст. Убедитесь, что это изменение преднамеренно, и при необходимости исправьте файл пространства пакета.

source: Unexpected capabilities were found on the indicated file. Consult capabilities(7) and either adjust the files in the package or modify the capabilities list in the rpminspect vendor data package. The security team may also be of help for this situation.
ru: В указанном файле обнаружены неожиданные возможности. Проконсультируйтесь с capabilities(7) и либо настройте файлы в пакете, либо измените список возможностей в пакете данных поставщика rpminspect. Команда безопасности также может помочь в этой ситуации.

source: Kernel module parameters were removed between builds. This may present usability problems for users if module parameters were removed in a maintenance update.
ru: Параметры модуля ядра были удалены между сборками. Это может вызвать проблемы с удобством использования для пользователей, если параметры модуля были удалены при обновлении обслуживания.

source: Kernel module dependencies changed between builds. This may present usability problems for users if module dependencies changed in a maintenance update.
ru: Зависимости модулей ядра менялись между сборками. Это может вызвать проблемы с удобством использования для пользователей, если зависимости модулей изменились в обновлении обслуживания.

source: Kernel module device aliases changed between builds. This may present usability problems for users if module device aliases changed in a maintenance update.
ru: Псевдонимы устройств модуля ядра меняются между сборками. Это может создать проблемы с удобством использования для пользователей, если псевдонимы устройств модуля изменились в обновлении обслуживания.

source: An architecture present in the before build is now missing in the after build. This may be deliberate, but check to make sure you do not have any unexpected ExclusiveArch lines in the spec file.
ru: Архитектура, присутствующая в предыдущей сборке, теперь отсутствует в последующей сборке. Это может быть сделано намеренно, но убедитесь, что в файле спецификации нет неожиданных строк ExclusiveArch.

source: A new architecture has appeared in the after build. This may indicate progress in the world of computing.
ru: В после постройки появилась новая архитектура. Это может указывать на прогресс в мире вычислений.

source: A subpackage present in the before build is now missing in the after build. This may be deliberate, but check to make sure you have correct syntax defining the subpackage in the spec file
ru: Подпакет, присутствующий в предыдущей сборке, теперь отсутствует в последующей сборке. Это может быть сделано намеренно, но убедитесь, что у вас есть правильный синтаксис, определяющий подпакет в файле спецификации

source: A new subpackage has appeared in the after build. This may indicate progress in the world of computing.
ru: В последующей сборке появился новый подпакет. Это может указывать на прогресс в мире вычислений.

source: Make sure the spec file in the after build contains a valid %changelog section.
ru: Убедитесь, что файл спецификации после сборки содержит допустимый раздел журнала %changelog.

source: Files should not be installed in old directory names. Modify the package to install the affected file to the preferred directory.
ru: Файлы не должны устанавливаться в старые имена каталогов. Измените пакет, чтобы установить уязвимый файл в предпочтительный каталог.

source: ELF .o and .a files should not carry LTO (Link Time Optimization) bytecode. Make sure you have stripped LTO bytecode from those files at install time.
ru: Файлы ELF .o и .a не должны содержать байт-код LTO (оптимизации времени соединения). Убедитесь, что вы удалили байт-код LTO из этих файлов во время установки.

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations.
ru: Убедитесь, что символические ссылки указывают на допустимый пункт назначения в одном из подпакетов сборки; висячие символические ссылки не допускаются. Если вы сравниваете сборки и у вас не символическая ссылка превращается в символическую, убедитесь, что это сделано намеренно. ПРИМЕЧАНИЕ. Вы не можете превратить каталог в символическую ссылку из-за ограничений RPM.

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations. If you absolutely must do that, make sure you include the %pretrans scriptlet for replacing a directory. See the packaging guidelines for 'Scriptlet to replace a directory' for more information.
ru: Убедитесь, что символические ссылки указывают на допустимый пункт назначения в одном из подпакетов сборки; висячие символические ссылки не допускаются. Если вы сравниваете сборки и у вас не символическая ссылка превращается в символическую, убедитесь, что это сделано намеренно. ПРИМЕЧАНИЕ. Вы не можете превратить каталог в символическую ссылку из-за ограничений RPM. Если это абсолютно необходимо, убедитесь, что вы включили скриптлет %pretrans для замены каталога. См. Инструкции по упаковке для 'Скриптлета для замены каталога' для получения дополнительной информации.

source: Remove forbidden path references from the indicated line in the %files section. In many cases you can use RPM macros to specify path locations. See the RPM documentation or distribution package maintainer guide for more information.
ru: Удалите ссылки на запрещенные пути из указанной строки в разделе %files. Во многих случаях вы можете использовать макросы RPM для указания местоположения пути. Дополнительную информацию см. В документации RPM или в руководстве по сопровождению пакета распространения.

source: In many cases the changing MIME type is deliberate. Verify that the change is intended and if necessary fix the spec file so the correct file is included in the built package.
ru: Во многих случаях изменение типа MIME является преднамеренным. Убедитесь, что изменение предназначено, и при необходимости исправьте файл спецификации, чтобы правильный файл был включен в собранный пакет.

source: ABI changes introduced during maintenance updates can lead to problems for users. See the abidiff(1) documentation and the distribution ABI policies to determine if this detected change is allowed.
ru: Изменения ABI, внесенные во время обслуживания обновлений, могут привести к проблемам для пользователей. См. Документацию abidiff(1) и политики ABI распространения, чтобы определить, допустимо ли это обнаруженное изменение.

source: Kernel Module Interface introduced during maintenance updates can lead to problems for users. See the libabigail documentation and the distribution KMI policy to determine if this detected change is allowed.
ru: Интерфейс модуля ядра, представленный во время обслуживания обновлений, может привести к проблемам для пользователей. См. Документацию libabigail и политику KMI распространения, чтобы определить, допустимо ли это обнаруженное изменение.

source: Changes to %config should be done carefully. Make sure you have installed the correct file and in the correct location. If a package is restructuring configuration files, make sure the package can handle upgrading an existing package -or- honor the old file locations.
ru: Изменять %config следует осторожно. Убедитесь, что вы установили правильный файл и в правильном месте. Если пакет реструктурирует файлы конфигурации, убедитесь, что пакет может обрабатывать обновление существующего пакета - или соблюдать старые расположения файлов.

source: Changes found among the %doc files. Verify these changes are intended if the package is not a rebase. Sometimes upstream projects rename or move documentation files and the spec file needs to account for those changes.
ru: Обнаружены изменения среди файлов %doc. Убедитесь, что эти изменения предназначаются, если пакет не является перебазированием. Иногда вышестоящие проекты переименовывают или перемещают файлы документации, и в файле спецификации необходимо учитывать эти изменения.

source: An invalid patch file was found. This is usually the result of generating a collection of patches by comparing two trees. When files disappear that can lead to zero length patches in the resulting collection. Check to see if the source package has any zero length or otherwise invalid patches and correct the problem.
ru: Обнаружен недопустимый файл исправления. Обычно это результат создания коллекции патчей путем сравнения двух деревьев. Когда файлы исчезают, это может привести к появлению патчей нулевой длины в результирующей коллекции. Проверьте, есть ли в исходном пакете какие-либо исправления нулевой длины или иным образом недопустимые исправления, и устраните проблему.

source: ClamAV has found a virus in the named file. This may be a false positive, but you should manually inspect the file in question to ensure it is clean. This may be a problem with the ClamAV database or detection. If you are sure the file in question is clean, please file a bug with rpminspect for further help.
ru: ClamAV обнаружил вирус в указанном файле. Это может быть ложным срабатыванием, но вам следует вручную проверить соответствующий файл, чтобы убедиться, что он чист. Это может быть проблема с базой данных ClamAV или обнаружением. Если вы уверены, что файл, о котором идет речь, чистый, сообщите об ошибке в rpminspect для получения дополнительной помощи.

source: A file with potential politically sensitive content was found in the package. If this file is permitted, it should be added to the rpminspect vendor data package for the product.
ru: В пакете обнаружен файл с потенциально политически конфиденциальным содержимым. Если этот файл разрешен, его следует добавить в пакет данных поставщика rpminspect для продукта.

source: Forbidden symbols were found in an ELF file in the package. The configuration settings for rpminspect indicate the named symbols are forbidden in packages. If this is deliberate, you may want to disable the badfuncs inspection. If it is not deliberate, check the man pages for the named symbols to see what API functions have replaced the forbidden symbols. Usually a function is marked as deprecated but still provided in order to allow for backwards compatibility. Whenever possible the deprecated functions should not be used.
ru: Запрещенные символы были обнаружены в файле ELF в пакете. В настройках конфигурации для rpminspect указано, что именованные символы запрещены в пакетах. Если это сделано намеренно, вы можете отключить проверку badfuncs. Если это не умышленно, проверьте страницы руководства на предмет именованных символов, чтобы узнать, какие функции API заменили запрещенные символы. Обычно функция помечается как устаревшая, но все еще предоставляется для обеспечения обратной совместимости. По возможности не рекомендуется использовать устаревшие функции.

source: Either DT_RPATH or DT_RUNPATH properties were found on ELF shared objects in this package. The use of DT_RPATH and DT_RUNPATH is discouraged except in certain situations. Check to see that you a disabling rpath during the %build stage of the spec file. If you are unable to do this easily, you can try using a program such as patchelf to remove these properties from the ELF files.
ru: В общих объектах ELF в этом пакете были обнаружены свойства DT_RPATH или DT_RUNPATH. Использование DT_RPATH и DT_RUNPATH не рекомендуется, за исключением определенных ситуаций. Убедитесь, что вы отключили rpath на этапе %build файла спецификации. Если у вас не получается сделать это легко, вы можете попробовать использовать такую программу, как patchelf, чтобы удалить эти свойства из файлов ELF.

source: Both DT_RPATH and DT_RUNPATH properties were found in an ELF shared object. This indicates a linker error and should not happen. ELF objects should only carry DT_RPATH or DT_RUNPATH, never both.
ru: Оба свойства DT_RPATH и DT_RUNPATH были обнаружены в общем объекте ELF. Это указывает на ошибку компоновщика и не должно происходить. Объекты ELF должны содержать только DT_RPATH или DT_RUNPATH, но не оба сразу.

source: malformed ABI level identifier: %s
ru: неверный идентификатор уровня ABI: %s

source: ABI level %d already defined
ru: Уровень ABI %d уже определен

source: malformed ABI level entry: %s
ru: некорректная запись уровня ABI: %s

source: no koji build or task specified
ru: не указана сборка koji или задача

source: unable to create download directory %s
ru: невозможно создать каталог загрузок %s

source: unknown workdir type %d
ru: неизвестный тип рабочего каталога %d

source: unable to read %s, skipping
ru: не могу прочитать %s, пропускаю

source: unknown directory member encountered: %s
ru: обнаружен неизвестный член каталога: %s

source: Downloading module
ru: Загрузка модуля

source: Downloading RPM build
ru: Загрузка RPM сборки

source: ignoring malformed module metadata file: %s
ru: игнорирование искаженного файла метаданных модуля: %s

source: `%s' already exists
ru: `%s' уже существует

source: unable to find after build: %s
ru: невозможно найти после сборки: %s
